/*
*
* Copyright (c) 2021 Texas Instruments Incorporated
*
* All rights reserved not granted herein.
*
* Limited License.
*
* Texas Instruments Incorporated grants a world-wide, royalty-free, non-exclusive
* license under copyrights and patents it now or hereafter owns or controls to make,
* have made, use, import, offer to sell and sell ("Utilize") this software subject to the
* terms herein.  With respect to the foregoing patent license, such license is granted
* solely to the extent that any such patent is necessary to Utilize the software alone.
* The patent license shall not apply to any combinations which include this software,
* other than combinations with devices manufactured by or for TI ("TI Devices").
* No hardware patent is licensed hereunder.
*
* Redistributions must preserve existing copyright notices and reproduce this license
* (including the above copyright notice and the disclaimer and (if applicable) source
* code license limitations below) in the documentation and/or other materials provided
* with the distribution
*
* Redistribution and use in binary form, without modification, are permitted provided
* that the following conditions are met:
*
* *       No reverse engineering, decompilation, or disassembly of this software is
* permitted with respect to any software provided in binary form.
*
* *       any redistribution and use are licensed by TI for use only with TI Devices.
*

#include <ti/boot/sbl/src/rprc/sbl_rprc_parse.h>
#include <ti/boot/sbl/src/mmcsd/sbl_mmcsd.h>
#include <ti/boot/sbl/src/ospi/sbl_ospi.h>
#include <ti/boot/sbl/soc/sbl_soc.h>
#include <ti/boot/sbl/soc/k3/sbl_slave_core_boot.h>
#include <ti/boot/sbl/soc/k3/sbl_profile.h>
#include <ti/boot/sbl/soc/k3/sbl_soc_cfg.h>
#include <ti/boot/sbl/soc/k3/sbl_qos.h>
#include <ti/boot/sbl/soc/k3/sbl_log.h>
#include <ti/boot/sbl/soc/k3/sbl_qos.h>

#include <ti/csl/cslr_gtc.h>

#include <ti/drv/mmcsd/MMCSD.h>
#include <ti/drv/mmcsd/soc/MMCSD_soc.h>
#include <ti/drv/mmcsd/src/MMCSD_osal.h>

#include <ti/drv/spi/soc/SPI_soc.h>
#include <ti/board/board.h>
#include <ti/board/board_cfg.h>
#include <ti/board/src/flash/include/board_flash.h>
#if defined(SOC_J721E)
#include <ti/board/src/j721e_evm/include/board_control.h>
#endif
#if defined(SOC_J7200)
#include <ti/board/src/j7200_evm/include/board_control.h>
#endif

#include "boot_core_defs.h"
#include "print_utils.h"

#include <ti/osal/osal.h>
#include <ti/osal/TaskP.h>

/* PM Lib */
#include <ti/drv/pm/include/pm_types.h>
#include <ti/drv/pm/include/dmsc/pmlib_sysconfig.h>
#include <ti/drv/pm/include/dmsc/pmlib_clkrate.h>

/* ========================================================================== */
/*                           Macros & Typedefs                                */
/* ========================================================================== */
#define TCLR_ST			(0x1 << 0)
#define TCLR_AR			(0x1 << 1)
#define TCLR_PRE		(0x1 << 5)

#define TSICR_POST		(0x1 << 2)

#define MCU_TIMER0_BASE CSL_MCU_TIMER0_CFG_BASE
#define MCU_TIMER1_BASE CSL_MCU_TIMER1_CFG_BASE
#define MCU_TIMER2_BASE CSL_MCU_TIMER2_CFG_BASE
#define MCU_TIMER3_BASE CSL_MCU_TIMER3_CFG_BASE

#define MCU_PROFILING_TIMER_BASE MCU_TIMER2_BASE

/* Clocks */
#define CLK_12M_RC_FREQ           (12500000ULL)
#define CLK_200M_RC_DEFAULT_FREQ (200000000ULL)  /* Timer 2 clock frequency set by default to 200MHz */

#define MCU_TIMER_PTV       2
#define MCU_TIMER_CLOCK     (CLK_200M_RC_DEFAULT_FREQ / (2 << MCU_TIMER_PTV))
#define MCU_TIMER_LOAD_VAL	      0

#define writel(x,y)               (*((uint64_t *)(y))=(x))
#define readl(x)                  (*((uint64_t *)(x)))

/* Enables SBL logs */
/* #define SBL_BOOTLOG_OUTPUT_ENABLED */

#if !defined(SOC_J721E) && !defined(SOC_J7200)
/* Performs Sciclient board setup for DEVGRP_01 */
#define BOOTAPP_MAINDOMAIN_BOARD_SETUP
#endif

/* Includes timestamps for OSPI memcpy's.
 * Should only be defined for OSPI build */
/* #define PROFILE_OSPI_READS_ENABLED */

/* Includes printout of Boot Stage core requests and image copies */
/* #define GATHER_STAGE_DETAILS */

/* NOTE: Secure boot is not yet supported on J721E */
/* #define SECURE_BOOT */

/* ========================================================================== */
/*                         Structures and Enums                               */
/* ========================================================================== */

#if defined(BOOTAPP_MAINDOMAIN_BOARD_SETUP)
struct bootApp_boardcfg_rm_resasg
{
    struct tisci_boardcfg_substructure_header subhdr;
    uint16_t                    resasg_entries_size;
    uint16_t                    reserved;
} __attribute__((__packed__));

struct bootApp_boardcfg_rm
{
    struct tisci_boardcfg_abi_rev     rev;
    struct tisci_boardcfg_rm_host_cfg host_cfg;
    struct bootApp_boardcfg_rm_resasg resasg;
} __attribute__((__packed__));

struct bootApp_local_rm_boardcfg
{
    struct bootApp_boardcfg_rm            rm_boardcfg;
    struct tisci_boardcfg_rm_resasg_entry resasg_entries[TISCI_RESASG_ENTRIES_MAX];
};

#pragma DATA_SECTION(bootAppBoardCfg, ".sysfw_data_cfg_board")
struct tisci_boardcfg bootAppBoardCfg;
#pragma DATA_SECTION(bootAppBoardCfg_rm, ".sysfw_data_cfg_board_rm")
struct bootApp_local_rm_boardcfg bootAppBoardCfg_rm;
#pragma DATA_SECTION(bootAppBoardCfg_sec, ".sysfw_data_cfg_board_sec")
struct tisci_boardcfg_sec bootAppBoardCfg_sec;
#endif /* BOOTAPP_MAINDOMAIN_BOARD_SETUP */

typedef struct
{
    uint8_t     sbl_boot_buff[SBL_MAX_BOOT_BUFF_SIZE+1];
    uint32_t    sbl_boot_size;
    uint32_t    sbl_boot_buff_idx;
} SBL_incomingBootData_S;

/* ========================================================================== */
/*              Internal Function Declarations                                */
/* ========================================================================== */


/* ========================================================================== */
/*                            Global Variables                                */
/* ========================================================================== */

#if defined(BOOT_OSPI)
/* Offset into app image that is being processed */
static uint32_t xipMemBase = 0x50000000;

static OSPI_v0_HwAttrs ospi_cfg;

static void *boardHandle = NULL;
#endif

sblEntryPoint_t k3xx_evmEntry;
SBL_incomingBootData_S sblInBootData __attribute__ ((section (".sblbootbuff")));

struct mcu_timer {
	uint32_t tidr;		/* 0x00 r */
	uint8_t  res1[0xc];
	uint32_t tiocp_cfg;		/* 0x10 rw */
	uint8_t  res2[0xc];
	uint32_t teoir;		/* 0x20 rw */
	uint32_t tisr_raw;		/* 0x24 r */
	uint32_t tisr;		/* 0x28 rw */
	uint32_t tier;		/* 0x2c rw */
	uint32_t ticr;		/* 0x30 rw */
	uint32_t twer;		/* 0x34 rw */
	uint32_t tclr;		/* 0x38 rw */
	uint32_t tcrr;		/* 0x3c rw */
	uint32_t tldr;		/* 0x40 rw */
	uint32_t ttgr;		/* 0x44 rw */
	uint32_t twps;		/* 0x48 r */
	uint32_t tmar;		/* 0x4c rw */
	uint32_t tcar1;		/* 0x50 r */
	uint32_t tsicr;		/* 0x54 rw */
	uint32_t tcar2;		/* 0x58 r */
	uint32_t tpir;		/* 0x5c rw */
	uint32_t tnir;		/* 0x60 rw */
	uint32_t tcvr;		/* 0x64 rw */
	uint32_t tocr;		/* 0x68 rw */
	uint32_t towr; 		/* 0x6c rw */
};

static struct mcu_timer *timer_base = (struct mcu_timer *)MCU_PROFILING_TIMER_BASE;

/* ========================================================================== */
/*                            External Variables                              */
/* ========================================================================== */

/* SBL functions required for standard boot */
extern uint32_t SBL_IsSysfwEnc(uint8_t *x509_cert_ptr);
extern int32_t  SBL_FileRead(void  *buff, void *fileptr, uint32_t size);
extern void     SBL_FileSeek(void *fileptr, uint32_t location);
extern void     SBL_DCacheClean(void *addr, uint32_t size);
/* Function Pointer used while reading data from the storage. */
extern int32_t  (*fp_readData)(void *dstAddr, void *srcAddr, uint32_t length);
extern void     (*fp_seek)(void *srcAddr, uint32_t location);

/* SBL structures required for standard boot */
/* FATFS Handle */
extern FATFS_Handle  sbl_fatfsHandle;
